[
  {
    "id": "Light Diseases and Disorders of Pigmentation",
    "data": "Disorders of pigmentation include conditions that result in either hyperpigmentation or hypopigmentation. Common light-related disorders include vitiligo, characterized by the loss of melanocytes resulting in well-demarcated depigmented macules; and post-inflammatory hypopigmentation or hyperpigmentation, which occur after skin inflammation. Solar lentigines and melasma are examples of hyperpigmented conditions caused or worsened by UV exposure. Diagnosis often involves Wood’s lamp examination, skin biopsy, or laboratory tests to rule out autoimmune or metabolic causes. Management may include sun protection, topical corticosteroids, calcineurin inhibitors, or pigment-modulating agents like hydroquinone. Psychological support is crucial, especially for conditions like vitiligo, which may have significant cosmetic and emotional impact."
  },
  {
    "id": "Lupus and other Connective Tissue diseases",
    "data": "Cutaneous lupus erythematosus (CLE) is part of a spectrum of autoimmune connective tissue diseases, most notably systemic lupus erythematosus (SLE). It presents in various forms such as discoid lupus (DLE), subacute cutaneous lupus (SCLE), and acute cutaneous lupus. Skin findings may include erythematous scaly plaques, photosensitivity, and malar rash. Other connective tissue diseases include dermatomyositis (characterized by heliotrope rash and Gottron’s papules) and scleroderma (marked by skin thickening and tightening). Diagnosis includes ANA testing, biopsy with direct immunofluorescence, and systemic evaluation. Management typically includes antimalarials (hydroxychloroquine), corticosteroids, and sun protection. Systemic immunosuppressants are used for more severe manifestations."
  },
  {
    "id": "Acne and Rosacea Photos",
    "data": "Acne vulgaris is a chronic inflammatory condition of the pilosebaceous unit, most commonly affecting adolescents. It presents with comedones, papules, pustules, and in severe cases, nodules or cysts. Rosacea, often mistaken for acne, typically affects middle-aged adults and presents with central facial erythema, telangiectasia, and sometimes papulopustular lesions. Triggers include sunlight, heat, spicy food, and alcohol. Treatment for acne includes topical retinoids, benzoyl peroxide, antibiotics, and isotretinoin for severe cases. Rosacea is managed with topical metronidazole, azelaic acid, and oral antibiotics. Laser therapy may help with persistent erythema. Early treatment can prevent scarring and improve quality of life."
  },
  {
    "id": "Systemic Disease",
    "data": "Cutaneous manifestations of systemic diseases provide critical diagnostic clues. For example, acanthosis nigricans may signal insulin resistance or internal malignancy, while erythema nodosum can indicate sarcoidosis, tuberculosis, or inflammatory bowel disease. Conditions like dermatomyositis and systemic sclerosis show distinctive skin signs associated with systemic involvement. Systemic lupus erythematosus may present with the classic malar rash. Diagnosis involves correlating skin findings with systemic symptoms and laboratory data. Management targets the underlying disease and may require a multidisciplinary approach including rheumatologists, endocrinologists, and dermatologists. Dermatologic treatments such as topical corticosteroids and immunomodulators may provide symptomatic relief."
  },
  {
    "id": "Poison Ivy Photos and other Contact Dermatitis",
    "data": "Contact dermatitis is an inflammatory skin reaction caused by exposure to allergens or irritants. Poison ivy induces an allergic contact dermatitis via urushiol oil, resulting in intensely pruritic, linear vesicles or bullae. Irritant contact dermatitis is more common and results from direct chemical or physical insult, often presenting as erythema, scaling, or fissuring. Diagnosis relies on clinical history, distribution pattern, and may include patch testing. Treatment involves identification and avoidance of the offending agent, along with topical corticosteroids, antihistamines, and in severe cases, systemic corticosteroids. Education on preventive measures is crucial to reduce recurrence."
  },
  {
    "id": "Vascular Tumors",
    "data": "Vascular tumors of the skin include a range of benign and malignant neoplasms derived from blood vessels. Hemangiomas are the most common benign vascular tumors in infants, typically presenting as red or bluish nodules that often involute spontaneously. Other benign types include pyogenic granulomas and angiokeratomas. Malignant vascular tumors, such as angiosarcoma and Kaposi’s sarcoma, are rare but aggressive, and often linked to immunosuppression or chronic lymphedema. Diagnosis is based on clinical features and histopathological evaluation. Management depends on the tumor type and may include observation, laser therapy, surgical excision, or chemotherapy for malignant forms."
  },
  {
    "id": "Urticaria Hives",
    "data": "Urticaria, commonly known as hives, is a transient skin condition characterized by raised, itchy wheals that may be erythematous or skin-colored. It can be acute (lasting less than 6 weeks) or chronic. Common triggers include food allergens, medications, infections, stress, or physical stimuli (cold, pressure, vibration). In some cases, it is idiopathic. Angioedema may accompany urticaria, particularly around the eyes, lips, or throat, and requires immediate attention if airway compromise is suspected. Diagnosis is largely clinical, with lab workup reserved for chronic or recurrent cases. Treatment includes antihistamines, avoidance of known triggers, and in severe cases, corticosteroids or biologics like omalizumab."
  },
  {
    "id": "Atopic Dermatitis Photos",
    "data": "Atopic dermatitis (AD) is a chronic, relapsing inflammatory skin disease associated with genetic, immunologic, and environmental factors. It typically begins in infancy or childhood and is characterized by xerosis, pruritus, and eczematous lesions distributed flexurally in older children and adults. It is often associated with a personal or family history of atopy, including asthma and allergic rhinitis. The skin barrier dysfunction and immune dysregulation lead to increased susceptibility to infections. Diagnosis is clinical, based on established criteria. Treatment involves skin hydration, topical corticosteroids, calcineurin inhibitors, and in severe cases, systemic agents like cyclosporine or dupilumab. Avoidance of triggers and consistent skincare are crucial for control."
  },
  {
    "id": "Bullous Disease Photos",
    "data": "Bullous diseases encompass a group of disorders characterized by the formation of blisters or bullae. These include autoimmune conditions such as bullous pemphigoid, pemphigus vulgaris, and dermatitis herpetiformis. Bullous pemphigoid typically affects elderly patients and presents with tense bullae on erythematous or normal skin. Pemphigus vulgaris involves flaccid bullae that rupture easily and often affect mucous membranes. Diagnosis is confirmed via biopsy with direct immunofluorescence and detection of circulating autoantibodies. Treatment involves systemic corticosteroids and immunosuppressants. Prompt diagnosis is essential due to the risk of widespread skin involvement and associated complications such as infections and fluid imbalance."
  },
  {
    "id": "Hair Loss Photos Alopecia and other Hair Diseases",
    "data": "Hair disorders range from non-scarring to scarring types of alopecia. Androgenetic alopecia, or pattern hair loss, is the most common cause and is hormonally driven. Alopecia areata is an autoimmune condition resulting in patchy hair loss with possible nail pitting. Telogen effluvium is a temporary shedding of hair following stress or illness. Scarring alopecias such as lichen planopilaris involve permanent follicular destruction. Diagnosis is based on history, examination, and sometimes scalp biopsy or dermoscopy. Treatment varies depending on the type, including topical minoxidil, corticosteroids, immunotherapy, or systemic treatments like finasteride or JAK inhibitors. Early intervention improves outcomes."
  },
  {
    "id": "Tinea Ringworm Candidiasis and other Fungal Infections",
    "data": "Fungal skin infections are common and include superficial dermatophytoses (tinea), candidiasis, and other yeast infections. Tinea corporis (ringworm) presents as annular, scaly plaques with central clearing. Tinea pedis (athlete’s foot), tinea capitis (scalp), and tinea cruris (groin) are other variants. Candidiasis often affects moist, intertriginous areas and is common in immunocompromised or diabetic patients. Diagnosis is clinical and confirmed via KOH prep or fungal culture. Treatment includes topical or systemic antifungals such as terbinafine, clotrimazole, or fluconazole depending on severity and site. Prevention involves hygiene, moisture control, and treating predisposing conditions like diabetes."
  },
  {
    "id": "Psoriasis pictures Lichen Planus and related diseases",
    "data": "Psoriasis is a chronic autoimmune disorder that affects the skin and sometimes the joints. It is characterized by erythematous plaques with silvery-white scales, often affecting the scalp, elbows, knees, and sacral area. Triggers include stress, infections, medications, and cold weather. Lichen planus is another inflammatory dermatosis that presents as pruritic, purple, polygonal papules with Wickham striae, often affecting wrists and oral mucosa. Both conditions may require biopsy for definitive diagnosis. Treatment for both includes topical steroids, phototherapy, systemic immunomodulators, and biologics targeting TNF-alpha, IL-17, or IL-23 pathways. Regular follow-up is essential due to chronicity and potential for complications like psoriatic arthritis."
  },
  {
    "id": "Melanoma Skin Cancer Nevi and Moles",
    "data": "Melanoma is a malignant tumor of melanocytes and is the deadliest form of skin cancer. It often arises in pre-existing nevi (moles) or as a new lesion. Risk factors include UV exposure, fair skin, numerous atypical nevi, and family history. The ABCDE rule (Asymmetry, Border irregularity, Color variation, Diameter >6mm, Evolution) helps in early detection. Diagnosis is confirmed with biopsy and histopathology. Treatment involves surgical excision with margins, and in advanced cases, immunotherapy (e.g., checkpoint inhibitors) or targeted therapy. Benign nevi are generally symmetrical with uniform color and size, but any change warrants evaluation. Early detection significantly improves prognosis."
  },
  {
    "id": "Nail Fungus and other Nail Disease",
    "data": "Nail diseases include onychomycosis (fungal infection), psoriasis of the nails, lichen planus, trauma-related dystrophies, and paronychia. Onychomycosis causes thickened, discolored, and brittle nails, commonly due to dermatophytes. Diagnosis is confirmed with KOH prep or fungal culture. Nail psoriasis presents with pitting, oil drop discoloration, and subungual hyperkeratosis. Lichen planus of the nail may cause longitudinal ridging or pterygium formation. Management depends on etiology: antifungals for onychomycosis, topical or intralesional steroids for inflammatory causes, and protective measures to avoid trauma. Nail disorders can signal systemic disease, necessitating a thorough evaluation."
  },
  {
    "id": "Scabies Lyme Disease and other Infestations and Bites",
    "data": "Scabies is a parasitic infestation caused by Sarcoptes scabiei, presenting as intense pruritus, especially at night, and burrows in interdigital spaces, wrists, and genital areas. It is highly contagious and treated with topical permethrin or oral ivermectin. Lyme disease is a tick-borne illness caused by Borrelia burgdorferi, initially presenting with erythema migrans and flu-like symptoms and potentially progressing to neurological, cardiac, or arthritic manifestations. Diagnosis is clinical and serological. Other infestations include lice, bedbugs, and flea bites. Management includes treating both the individual and close contacts, environmental decontamination, and appropriate antimicrobial or antiparasitic therapy."
  },
  {
    "id": "Eczema Photos",
    "data": "Eczema is a general term encompassing various inflammatory skin conditions, the most common being atopic dermatitis. Other forms include contact dermatitis, nummular eczema, and dyshidrotic eczema. Symptoms include pruritus, erythema, lichenification, and vesicle formation. Triggers vary by type and may include allergens, irritants, stress, or climate changes. Diagnosis is clinical, supported by history. Treatment includes moisturizers, topical corticosteroids, calcineurin inhibitors, and antihistamines. Identifying and avoiding triggers, gentle skin care, and in severe cases, phototherapy or systemic immunomodulators are critical to long-term management. Eczema significantly affects quality of life and may be chronic or relapsing."
  },
  {
    "id": "Exanthems and Drug Eruptions",
    "data": "Exanthems are widespread skin rashes often associated with viral infections, particularly in children. Common examples include measles, rubella, roseola, and parvovirus B19. Drug eruptions are adverse cutaneous reactions to medications, manifesting as morbilliform rashes, urticaria, or more severe forms like Stevens-Johnson Syndrome (SJS) or Toxic Epidermal Necrolysis (TEN). Diagnosis is based on clinical history and temporal relation to drug intake. Management involves discontinuation of the offending agent and supportive care. Severe reactions may require hospitalization, systemic steroids, or immunosuppressants. Early identification is crucial to prevent life-threatening complications, particularly in drug-induced cases."
  },
  {
    "id": "Herpes HPV and other STDs Photos",
    "data": "Sexually transmitted infections (STIs) affecting the skin include Herpes Simplex Virus (HSV), Human Papillomavirus (HPV), syphilis, and molluscum contagiosum. HSV presents as grouped vesicles on an erythematous base, often painful and recurrent. HPV causes genital warts and is linked to anogenital cancers. Syphilis may show primary chancre, secondary generalized rash (including palms/soles), or tertiary systemic manifestations. Diagnosis is based on clinical features, PCR, serology, or biopsy. Treatment includes antivirals (e.g., acyclovir for HSV), cryotherapy or imiquimod for HPV, and penicillin for syphilis. Partner treatment and safe sexual practices are essential for control and prevention."
  },
  {
    "id": "Seborrheic Keratoses and other Benign Tumors",
    "data": "Seborrheic keratoses are common benign epidermal tumors that appear as well-demarcated, waxy, 'stuck-on' lesions, often brown or black. They typically affect older adults and increase with age. While benign, rapid changes in size or color may warrant a biopsy to exclude malignancy. Other benign tumors include dermatofibromas, lipomas, epidermoid cysts, and cherry angiomas. Diagnosis is clinical but can be confirmed by dermoscopy or histology. Treatment is not usually necessary unless for cosmetic reasons or irritation, and options include cryotherapy, curettage, or laser ablation. It is essential to distinguish these from malignant lesions like melanoma."
  },
  {
    "id": "Actinic Keratosis Basal Cell Carcinoma and other Malignant Lesions",
    "data": "Actinic keratoses (AKs) are precancerous lesions caused by cumulative sun exposure, presenting as rough, scaly patches on sun-exposed areas. They can progress to squamous cell carcinoma (SCC). Basal cell carcinoma (BCC), the most common skin cancer, often appears as a pearly papule with telangiectasias and rarely metastasizes. SCC has a higher metastatic risk and may present as ulcerated or keratotic plaques. Diagnosis is clinical and confirmed by biopsy. Treatment includes cryotherapy, topical 5-FU or imiquimod, curettage, and excision. Mohs surgery is used for high-risk or recurrent cancers. Prevention through sun protection is critical."
  },
  {
    "id": "Vasculitis Photos",
    "data": "Cutaneous vasculitis involves inflammation of blood vessels in the skin, presenting as palpable purpura, petechiae, ulcers, or nodules. It can be idiopathic or associated with infections, medications, autoimmune diseases, or malignancies. Types include leukocytoclastic vasculitis, Henoch-Schönlein purpura (IgA vasculitis), and urticarial vasculitis. Diagnosis involves clinical evaluation, skin biopsy, and laboratory testing for systemic involvement. Management depends on the cause and severity, ranging from removal of the trigger and supportive care to systemic corticosteroids or immunosuppressants. Systemic involvement (e.g., renal or gastrointestinal) requires urgent multidisciplinary management."
  },
  {
    "id": "Cellulitis Impetigo and other Bacterial Infections",
    "data": "Bacterial skin infections include cellulitis, erysipelas, impetigo, and folliculitis. Cellulitis is a deep dermal infection causing erythema, warmth, swelling, and pain, often with systemic symptoms. Impetigo is a superficial infection common in children, characterized by honey-colored crusts caused by Staphylococcus aureus or Streptococcus pyogenes. Diagnosis is clinical, though cultures may guide therapy in severe or recurrent cases. Treatment involves topical antibiotics for mild impetigo and systemic antibiotics (e.g., cephalexin, clindamycin) for cellulitis. Prevention includes good hygiene and prompt treatment of skin injuries. Complications may include abscess formation or systemic spread."
  },
  {
    "id": "Warts Molluscum and other Viral Infections",
    "data": "Cutaneous viral infections include warts (caused by human papillomavirus), molluscum contagiosum (a poxvirus), and other viral exanthems. Warts can be common, plantar, or genital and present as rough, hyperkeratotic papules. Molluscum appears as dome-shaped, umbilicated papules, often in children or immunocompromised adults. Diagnosis is clinical. Treatment options include cryotherapy, salicylic acid, curettage, and topical agents like cantharidin or imiquimod. Most cases resolve spontaneously, but treatment may be desired for cosmetic reasons or to prevent spread. Education on hygiene and avoidance of skin trauma is key to reducing transmission."
  },
  {
    "id": "24",
    "data": "{\"condition\": \"Warts Molluscum and other Viral Infections\", \"overview\": \"Skin condition identified from image analysis with 64.61% confidence\", \"symptoms\": \"Symptoms to be determined based on patient description\", \"treatment\": \"Treatment recommendations to be provided by healthcare professional\", \"patient_explanation\": \"This appears to be Warts Molluscum and other Viral Infections based on the image analysis\"}"
  },
  {
    "id": "25",
    "data": "{\"condition\": \"Warts Molluscum and other Viral Infections\", \"overview\": \"Skin condition identified from image analysis with 64.61% confidence\", \"symptoms\": \"Symptoms to be determined based on patient description\", \"treatment\": \"Treatment recommendations to be provided by healthcare professional\", \"patient_explanation\": \"This appears to be Warts Molluscum and other Viral Infections based on the image analysis\"}"
  }
]